example/cavity/Fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

preciceConfig   "../precice-config.xml";

participant     Fluid_Solver;

modules         (FSI);

interfaces
{

    Interface1
    {
        mesh              Fluid_Nodes;

        patches           (bottomWall);
        locations         faceNodes;

        readData
        (
            DisplacementDelta
        );

        writeData
        (
        );
    };

    Interface2
    {

        mesh              Fluid_CellCenters;

        patches           (bottomWall);
        locations         faceCenters;

        readData
        (
        );

        writeData
        (
            Force
        );
    };

};

FSI
{
    rho     rho     [1 -3 0 0 0 0 0]    1.0;
}

// ************************************************************************* //
